Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_XBARA.h
/*! @name SEL70 - Crossbar A Select Register 70 */
/*! @{ */

#define XBARA_SEL70_SEL140_MASK                  (0xFFU)
#define XBARA_SEL70_SEL140_SHIFT                 (0U)
#define XBARA_SEL70_SEL140(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL70_SEL140_SHIFT)) & XBARA_SEL70_SEL140_MASK)

#define XBARA_SEL70_SEL141_MASK                  (0xFF00U)
#define XBARA_SEL70_SEL141_SHIFT                 (8U)
#define XBARA_SEL70_SEL141(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL70_SEL141_SHIFT)) & XBARA_SEL70_SEL141_MASK)
/*! @} */

/*! @name SEL71 - Crossbar A Select Register 71 */
/*! @{ */

#define XBARA_SEL71_SEL142_MASK                  (0xFFU)
#define XBARA_SEL71_SEL142_SHIFT                 (0U)
#define XBARA_SEL71_SEL142(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL71_SEL142_SHIFT)) & XBARA_SEL71_SEL142_MASK)

#define XBARA_SEL71_SEL143_MASK                  (0xFF00U)
#define XBARA_SEL71_SEL143_SHIFT                 (8U)
#define XBARA_SEL71_SEL143(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL71_SEL143_SHIFT)) & XBARA_SEL71_SEL143_MASK)
/*! @} */

/*! @name SEL72 - Crossbar A Select Register 72 */
/*! @{ */

#define XBARA_SEL72_SEL144_MASK                  (0xFFU)
#define XBARA_SEL72_SEL144_SHIFT                 (0U)
#define XBARA_SEL72_SEL144(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL72_SEL144_SHIFT)) & XBARA_SEL72_SEL144_MASK)

#define XBARA_SEL72_SEL145_MASK                  (0xFF00U)
#define XBARA_SEL72_SEL145_SHIFT                 (8U)
#define XBARA_SEL72_SEL145(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL72_SEL145_SHIFT)) & XBARA_SEL72_SEL145_MASK)
/*! @} */

/*! @name SEL73 - Crossbar A Select Register 73 */
/*! @{ */

#define XBARA_SEL73_SEL146_MASK                  (0xFFU)
#define XBARA_SEL73_SEL146_SHIFT                 (0U)
#define XBARA_SEL73_SEL146(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL73_SEL146_SHIFT)) & XBARA_SEL73_SEL146_MASK)

#define XBARA_SEL73_SEL147_MASK                  (0xFF00U)
#define XBARA_SEL73_SEL147_SHIFT                 (8U)
#define XBARA_SEL73_SEL147(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL73_SEL147_SHIFT)) & XBARA_SEL73_SEL147_MASK)
/*! @} */

/*! @name SEL74 - Crossbar A Select Register 74 */
/*! @{ */

#define XBARA_SEL74_SEL148_MASK                  (0xFFU)
#define XBARA_SEL74_SEL148_SHIFT                 (0U)
#define XBARA_SEL74_SEL148(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL74_SEL148_SHIFT)) & XBARA_SEL74_SEL148_MASK)

#define XBARA_SEL74_SEL149_MASK                  (0xFF00U)
#define XBARA_SEL74_SEL149_SHIFT                 (8U)
#define XBARA_SEL74_SEL149(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL74_SEL149_SHIFT)) & XBARA_SEL74_SEL149_MASK)
/*! @} */

/*! @name SEL75 - Crossbar A Select Register 75 */
/*! @{ */

#define XBARA_SEL75_SEL150_MASK                  (0xFFU)
#define XBARA_SEL75_SEL150_SHIFT                 (0U)
#define XBARA_SEL75_SEL150(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL75_SEL150_SHIFT)) & XBARA_SEL75_SEL150_MASK)

#define XBARA_SEL75_SEL151_MASK                  (0xFF00U)
#define XBARA_SEL75_SEL151_SHIFT                 (8U)
#define XBARA_SEL75_SEL151(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL75_SEL151_SHIFT)) & XBARA_SEL75_SEL151_MASK)
/*! @} */

/*! @name SEL76 - Crossbar A Select Register 76 */
/*! @{ */

#define XBARA_SEL76_SEL152_MASK                  (0xFFU)
#define XBARA_SEL76_SEL152_SHIFT                 (0U)
#define XBARA_SEL76_SEL152(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL76_SEL152_SHIFT)) & XBARA_SEL76_SEL152_MASK)

#define XBARA_SEL76_SEL153_MASK                  (0xFF00U)
#define XBARA_SEL76_SEL153_SHIFT                 (8U)
#define XBARA_SEL76_SEL153(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL76_SEL153_SHIFT)) & XBARA_SEL76_SEL153_MASK)
/*! @} */

/*! @name SEL77 - Crossbar A Select Register 77 */
/*! @{ */

#define XBARA_SEL77_SEL154_MASK                  (0xFFU)
#define XBARA_SEL77_SEL154_SHIFT                 (0U)
#define XBARA_SEL77_SEL154(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL77_SEL154_SHIFT)) & XBARA_SEL77_SEL154_MASK)

#define XBARA_SEL77_SEL155_MASK                  (0xFF00U)
#define XBARA_SEL77_SEL155_SHIFT                 (8U)
#define XBARA_SEL77_SEL155(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL77_SEL155_SHIFT)) & XBARA_SEL77_SEL155_MASK)
/*! @} */

/*! @name SEL78 - Crossbar A Select Register 78 */
/*! @{ */

#define XBARA_SEL78_SEL156_MASK                  (0xFFU)
#define XBARA_SEL78_SEL156_SHIFT                 (0U)
#define XBARA_SEL78_SEL156(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL78_SEL156_SHIFT)) & XBARA_SEL78_SEL156_MASK)

#define XBARA_SEL78_SEL157_MASK                  (0xFF00U)
#define XBARA_SEL78_SEL157_SHIFT                 (8U)
#define XBARA_SEL78_SEL157(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL78_SEL157_SHIFT)) & XBARA_SEL78_SEL157_MASK)
/*! @} */

/*! @name SEL79 - Crossbar A Select Register 79 */
/*! @{ */

#define XBARA_SEL79_SEL158_MASK                  (0xFFU)
#define XBARA_SEL79_SEL158_SHIFT                 (0U)
#define XBARA_SEL79_SEL158(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL79_SEL158_SHIFT)) & XBARA_SEL79_SEL158_MASK)

#define XBARA_SEL79_SEL159_MASK                  (0xFF00U)
#define XBARA_SEL79_SEL159_SHIFT                 (8U)
#define XBARA_SEL79_SEL159(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL79_SEL159_SHIFT)) & XBARA_SEL79_SEL159_MASK)
/*! @} */

/*! @name SEL80 - Crossbar A Select Register 80 */
/*! @{ */

#define XBARA_SEL80_SEL160_MASK                  (0xFFU)
#define XBARA_SEL80_SEL160_SHIFT                 (0U)
#define XBARA_SEL80_SEL160(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL80_SEL160_SHIFT)) & XBARA_SEL80_SEL160_MASK)

#define XBARA_SEL80_SEL161_MASK                  (0xFF00U)
#define XBARA_SEL80_SEL161_SHIFT                 (8U)
#define XBARA_SEL80_SEL161(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL80_SEL161_SHIFT)) & XBARA_SEL80_SEL161_MASK)
/*! @} */

